Revit 2027 API
BuiltInFailures.EditingFailures.PinnedObjectSomeDeleted Property
 Some pinned objects were deleted while others were not.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId PinnedObjectSomeDeleted { get; }
Public Shared ReadOnly Property PinnedObjectSomeDeleted As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ PinnedObjectSomeDeleted {
	FailureDefinitionId^ get ();
}
static member PinnedObjectSomeDeleted : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace